	 var pro=new Array()
	 pro[1]=[["3","377","378","379","380","381","382","383","384","385"],["北京","怀柔县","大兴县","顺义县","延庆县","密云县","昌平县","平谷县","通县","燕山"]]
pro[2]=[["4","386","387","388","389","390","391","392","393","394","395"],["上海","上海县","南汇县","青浦县","嘉定县","宝山县","奉贤县","崇明县","松江县","川沙县","金山县"]]
pro[5]=[["36","396","397","398","399","400","401"],["天津","宝坻县","静海县","武清县","宁河县","蓟县","塘沽区"]]
pro[6]=[["37"],["重庆"]]
pro[7]=[["38","39","40","41","42","43","44","45","46","47","48","49","50"],["广州","深圳","珠海","东莞","潮州","佛山","汕头","湛江","番禺","中山","惠州","揭阳","韶关"]]
pro[8]=[["51","52","53","54","55","56","57","58","59","60","61","62","63","64"],["南宁","柳州","桂林","百色","北海","崇左","防城港","贵港","河池","贺州","来宾","钦州","梧州","玉林"]]
pro[9]=[["65","66","67","68","69","70","71","72","73","74","75","76","77","78"],["石家庄","沧州","承德","秦皇岛","唐山","保定","廊坊","邢台","衡水","张家口","邯郸","任丘","河间","泊头"]]
pro[10]=[["79","80","81","82","83","84","85","86","87","88","89","90","91","92","93","94","95"],["郑州","安阳","鹤壁","焦作","开封","洛阳","漯河","南阳","平顶山","濮阳","三门峡","商丘","新乡","信阳","许昌","周口","驻马店"]]
pro[11]=[["96","97","98","99","100","101","102","103","104","105","106"],["太原","长治","大同","晋城","晋中","临汾","吕梁","朔州","忻州","阳泉","运城"]]
pro[12]=[["107","108","109","110","111","112","113","114","115","116","117","118","119","120"],["沈阳","大连","鞍山","本溪","朝阳","丹东","抚顺","阜新","葫芦岛","锦州","辽阳","盘锦","铁岭","营口"]]
pro[13]=[["121","122","123","124","125","126","127","128","129"],["长春","白城","白山","吉林市","辽源","四平","松原","通化","延边"]]
pro[14]=[["130","131","132","133","134","135","136","137","138","139","140","141","142"],["哈尔滨","大庆","大兴安岭","鹤岗","黑河","鸡西","佳木斯","牡丹江","七台河","齐齐哈尔","双鸭山","绥化","伊春"]]
pro[15]=[["143","144","145","146","147","148","149","150","151","152","153","154","155"],["南京","苏州","扬州","常州","淮安","连云港","南通","宿迁","泰州","无锡","徐州","盐城","镇江"]]
pro[16]=[["156","157","158","159","160","161","162","163","164","165","166"],["杭州","宁波","湖州","嘉兴","金华","丽水","衢州","绍兴","台州","温州","舟山"]]
pro[17]=[["167","168","169","170","171","172","173","174","175"],["福州","厦门","泉州","龙岩","南平","宁德","莆田","三明","漳州"]]
pro[18]=[["176","177","178","179","180","181","182","183","184","185","186","187","188","189","190","191","192"],["合肥","安庆","蚌埠","亳州","巢湖","池州","滁州","阜阳","淮北","淮南","黄山","六安马","鞍山","宿州","铜陵","芜湖","宣城"]]
pro[19]=[["193","194","195","196","197","198","199","200","201","202","203"],["南昌","抚州","赣州","吉安","景德镇","九江","萍乡","上饶","新余","宜春","鹰潭"]]
pro[20]=[["204","205","206","207","208","209","210","211","212","213","214","215","216","217","218","219","220"],["济南","青岛","淄博","滨州","东营","德州","菏泽","济宁","莱芜","聊城","临沂","日照","泰安","威海","潍坊","烟台","枣庄"]]
pro[21]=[["221","222","223","224","225","226","227","228","229","230","231","232","233","234"],["兰州","白银","定西","甘南州","嘉峪关","金昌","酒泉","临夏州","陇南","平凉","庆阳","天水","武威","张掖"]]
pro[22]=[["235","236","237","238","239","240","241","242","243","244"],["西安","安康","宝鸡","汉中","商洛","铜川","渭南","咸阳","延安","榆林"]]
pro[23]=[["245","246","247","248","249","250","251","252","253","254","255","256","257","258","259","260"],["昆明","保山","楚雄州","大理州","德宏州","迪庆州","红河州","丽江","临沧","怒江州","普洱","曲靖","昭通","文山","西双版纳","玉溪"]]
pro[24]=[["261","262","263","264","265","266","267","268","269"],["贵阳","安顺","毕节地区","六盘水","铜仁地区","遵义","黔西南州","黔东南州","黔南州"]]
pro[25]=[["270","271","272","273","274","275","276","277","278","279","280","281","282","283","284","285","286","287","288","289"],["成都","阿坝州","巴中达州","德阳","甘孜州","广安","广元","乐山","凉山州","泸州","南充","眉山","绵阳","内江","攀枝花","遂宁","雅安","宜宾","资阳","自贡"]]
pro[26]=[["290","291","292","293","294","295","296","297","298","299","300","301","302","303","304","305","306","307"],["海口","白沙","保亭","昌江","儋州","澄迈","东方","定安","琼海","琼中","乐东","临高","陵水","三亚","屯昌","万宁","文昌","五指山"]]
pro[27]=[["308","309","310","311","312","313","314","315","316","317","318","319","320","321"],["长沙","常德","郴州","衡阳","怀化","娄底","邵阳","湘潭","湘西州","益阳","永州","岳阳","张家界","株洲"]]
pro[28]=[["322","323","324","325","326","327","328","329","331","332","333","334","335","336","337"],["武汉","鄂州","恩施","黄冈","黄石","荆门","荆州","潜江","十堰随州","天门","仙桃","咸宁","襄樊","孝感","宜昌"]]
pro[29]=[["338","339","340","341","342","343","344","345","346","347","348","349","350"],["呼和浩特","阿拉善盟","包头","巴彦淖尔","赤峰","鄂尔多斯","呼伦贝尔","通辽","乌海","乌兰察布","锡林","郭勒盟","兴安盟"]]
pro[30]=[["351","352","353","354","355","356","357","358"],["西宁","果洛州","海东地区","海北州","海南州","海西州","黄南州","玉树州"]]
pro[31]=[["366","367","368","369","370","371","372"],["台北","高雄","台中","台南","新竹","基隆","嘉义"]]
pro[32]=[["359","360","361","362","363"],["银川","固原","石嘴山","吴忠","中卫"]]
pro[33]=[["364"],["乌鲁木齐"]]
pro[34]=[["365"],["拉萨"]]
pro[35]=[["373","374","375","376"],["美国","英国","日本","韩国"]]


   
     function getCity(id,cid){
        //获得省份下拉框的对象]
        var sltProvince=document.myform.province;
        //获得城市下拉框的对象
        var sltCity=document.myform.city;
        
        //得到对应省份的城市数组
		var provinceCity=pro[id];
 
        //清空城市下拉框，仅留提示选项
         sltCity.length=1;
        //将城市数组中的值填充到城市下拉框中
       for(var i=0;i<provinceCity[0].length;i++){
           sltCity[i+1]=new Option(pro[id][1][i],pro[id][0][i]);
		   if(cid == pro[id][0][i]){
            sltCity[i+1].selected = true;
           }
       }
     }
 window.onload=getCity(2)
//var xmlHttp;
//function S_xmlhttprequest(){
//	if(window.ActiveXobiect){
//		xmlHttp=new ActiveXobject('Microsoft.XMLHTTP');
//}else if (window.XMLHttpRequest){
//	xmlHttp= new XMLHttpRequest();
//}
//}
//function changecity(id){
//	var id=document.myform.province.value;
//    S_xmlhttprequest();
//    xmlHttp.open("GET","index.php?s=Area/Getcity/id/"+id,true);
//    xmlHttp.onreadystatechange=city;
//    xmlHttp.send(null);
//}
//function city(){
//         var cityname= xmlHttp.responseText;
//         document.getElementById('cityid').innerHTML=cityname;
//   }
//   
//function cityid(id){
//		var id=document.myform.cityid.value;
//		alert(id);
//        document.all.city.value=id;
//}
//
//function area_load(id)
//{
//          S_xmlhttprequest();
//          xmlHttp.open("GET","index.php?s=Area/Getcity/id/"+id,true);
//	      var data=xmlHttp.responseText;
//
//		  function(data){
//
//			$('#city').val(id);
//
//			$('#load_city').append(data);
//
//		  };
//
//}
//
//function area_reload()
//
//{
//
//	$('#load_city').html('');
//
//	area_load(0);
//
//}
//
//area_load(0);
